************************************************************************
* Program ID   : Z2512R0030_088
* Title        : [EDU] Cell Edit
* Create Date  : 2025-12-23
* Developer    : 조성민
* Tech. Script :
************************************************************************
* Change History.
************************************************************************
* Mod. # |Date           |Developer |Description(Reason)
************************************************************************
* 1.0.   |2025-12-23     |조성민    | inital Coding
************************************************************************
REPORT Z2512R0030_088.

INCLUDE Z2512R0030_088_CLS.
INCLUDE Z2512R0030_088_TOP.
INCLUDE Z2512R0030_088_SCR.

INCLUDE Z2512R0030_088_F01.
INCLUDE Z2512R0030_088_PBO.
INCLUDE Z2512R0030_088_PAI.

INITIALIZATION.
*&---------------------------------------------------------------------> 250805 : 편의성을 위한 초기값 세팅 제거
*  S_BEDAT-LOW = SY-DATUM.
*  APPEND S_BEDAT.
*&--------------------------------------------------------------------->

*&---------------------------------------------------------------------< 250807 : Selection Screen 초기값 구성(스펙서 요구사항)
  PERFORM INITIAL_VALUE.

START-OF-SELECTION.
  PERFORM SELECT_DATA.
  PERFORM DISPLAY_DATA.
