************************************************************************
* Program ID   : Z2508R0020_088
* Title        : [EDU] Simple ALV02
* Create Date  : 2025-08-06
* Developer    : 조성민
* Tech. Script :
************************************************************************
* Change History.
************************************************************************
* Mod. # |Date           |Developer |Description(Reason)
************************************************************************
* 1.0.   |2025-08-06     |조성민    | inital Coding
* 2.0.   |2025-08-07     |조성민    | Field Catalog 로직 개선(Global Variable을 활용한 로직 개선)
*        |2025-08-07     |조성민    | Selection Screen 초기값 구성 (스펙서 요구사항)
*        |2025-08-07     |조성민    | HOTSPOT EVENT 기능 추가 (스펙서 요구사항)
* 2.1.   |2025-08-08     |조성민    | 예외 처리 번역 작업 수행
************************************************************************
REPORT Z2508R0020_088.

INCLUDE Z2508R0020_088_CLS.
INCLUDE Z2508R0020_088_TOP.
INCLUDE Z2508R0020_088_SCR.

INCLUDE Z2508R0020_088_F01.
INCLUDE Z2508R0020_088_PBO.
INCLUDE Z2508R0020_088_PAI.

INITIALIZATION.
*&---------------------------------------------------------------------> 250805 : 편의성을 위한 초기값 세팅 제거
*  S_BEDAT-LOW = SY-DATUM.
*  APPEND S_BEDAT.
*&--------------------------------------------------------------------->

*&---------------------------------------------------------------------< 250807 : Selection Screen 초기값 구성(스펙서 요구사항)
  PERFORM INITIAL_VALUE.

START-OF-SELECTION.
  PERFORM SELECT_DATA.
  PERFORM DISPLAY_DATA.
