************************************************************************
* Program ID   : Z2508R0010_088
* Title        : [EDU] Simple ALV01
* Create Date  : 2025-08-05
* Developer    : 조성민
* Tech. Script :
************************************************************************
* Change History.
************************************************************************
* Mod. # |Date           |Developer |Description(Reason)
************************************************************************
*        |2025-08-05     |조성민    | inital Coding
************************************************************************
REPORT Z2508R0010_088.

INCLUDE Z2508R0010_088_CLS.
INCLUDE Z2508R0010_088_TOP.
INCLUDE Z2508R0010_088_SCR.

INCLUDE Z2508R0010_088_F01.
INCLUDE Z2508R0010_088_PBO.
INCLUDE Z2508R0010_088_PAI.

INITIALIZATION.
*&---------------------------------------------------------------------> 250805 : 편의성을 위한 초기값 세팅 제거
*  S_BEDAT-LOW = SY-DATUM.
*  APPEND S_BEDAT.
*&--------------------------------------------------------------------->

START-OF-SELECTION.
  PERFORM SELECT_DATA.
  PERFORM DISPLAY_DATA.
