************************************************************************
* Program ID   : Z2603R0030_088
* Title        : [EDU] Simple ALV01-Fcat 개선
* Create Date  : 2026-03-17
* Developer    : 조성민
* Tech. Script :
************************************************************************
* Change History.
************************************************************************
* Mod. # |Date           |Developer |Description(Reason)
************************************************************************
*        |2026-03-17     |조성민    | inital Coding
************************************************************************
REPORT Z2603R0030_088.

INCLUDE Z2603R0030_088_CLS.
INCLUDE Z2603R0030_088_TOP.
INCLUDE Z2603R0030_088_SCR.

INCLUDE Z2603R0030_088_F01.
INCLUDE Z2603R0030_088_PBO.
INCLUDE Z2603R0030_088_PAI.

INITIALIZATION.
*&---------------------------------------------------------------------> 250805 : 편의성을 위한 초기값 세팅 제거
*  S_BEDAT-LOW = SY-DATUM.
*  APPEND S_BEDAT.
*&--------------------------------------------------------------------->

START-OF-SELECTION.
  PERFORM SELECT_DATA.
  PERFORM DISPLAY_DATA.
