*&---------------------------------------------------------------------*
*& Include          Z2602R0030_088_TOP
*&---------------------------------------------------------------------*
**********************************************************************
* Tables
**********************************************************************
TABLES : CSKS, COSP.
**********************************************************************
* Variables
**********************************************************************
DATA : OK_CODE     TYPE SY-UCOMM,
       GV_KEY      TYPE WWWDATATAB,
       GV_FILE     TYPE STRING,
       GV_PATH     TYPE STRING,
       GV_FULLPATH TYPE RLGRAP-FILENAME,
       GV_USER_ACT TYPE I.
**********************************************************************
* TYPES
**********************************************************************
TYPES : BEGIN OF TS_REPORT
      , KOSTL    TYPE KOSTL        " 코스트 센터
      , KTEXT TYPE CSKT-KTEXT      " 코스트 센터명
      , PLAN_AMT TYPE COSP-WTG001  " 계획 금액
      , ACT_AMT  TYPE COSP-WTG001  " 실제 금액
  , END OF TS_REPORT
  , TY_REPORT TYPE TABLE OF TS_REPORT.
**********************************************************************
* ITAB
**********************************************************************
DATA : GS_REPORT TYPE TS_REPORT,
       GT_REPORT TYPE TY_REPORT.
**********************************************************************
* ALV
**********************************************************************

**********************************************************************
* OLE
**********************************************************************
DATA: G_EXCEL     TYPE OLE2_OBJECT,
      G_WORKBOOKS TYPE OLE2_OBJECT,
      G_WORKBOOK  TYPE OLE2_OBJECT,
      G_COLUMNS   TYPE OLE2_OBJECT,
      G_ROWS      TYPE OLE2_OBJECT,
      G_CELL      TYPE OLE2_OBJECT.
